# Objective

#### Construct and export a MySQL database using your data

In [1]:
# Imports
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *

In [2]:
# Load the the data
basics = pd.read_csv('Data/title_basics_cleaned.csv.gz')
ratings = pd.read_csv('Data/title_ratings_cleaned.csv.gz')
results = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [3]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86909 entries, 0 to 86908
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86909 non-null  object
 1   titleType       86909 non-null  object
 2   primaryTitle    86909 non-null  object
 3   originalTitle   86909 non-null  object
 4   isAdult         86909 non-null  int64
 5   startYear       86909 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86909 non-null  int64
 8   genres          86909 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 6.0+ MB

In [4]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503742 entries, 0 to 503741
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         503742 non-null  object
 1   averageRating  503742 non-null  float64
 2   numVotes       503742 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

# Normalize Genres Tables

In [5]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
86904,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
86905,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86906,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
86907,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86908,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [6]:
# One hot explode
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
86907,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
86907,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
86907,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
86908,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
86908,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [7]:
# Save a list of unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())

## Create a new title_genres table

In [8]:
# Save only the tconst and genres_split for new list
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Create a genre mapper dictionary to replace string genres with integers

In [9]:
# Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [10]:
# Replace the string genres in title_genres with the new integer ids
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [11]:
# Display
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
86907  tt9916190         0
86907  tt9916190         2
86907  tt9916190        22
86908  tt9916362         7
86908  tt9916362        11

[162411 rows x 2 columns]

## Convert the genre map dictionary into a dataframe

In [12]:
# Convert to a dataframe
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})
genre_lookup

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Sport        20
21   Talk-Show        21
22    Thriller        22
23         War        23
24     Western        24

# Creating the MySQL tables

In [13]:
# Begin with basics data
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86909 entries, 0 to 86908
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86909 non-null  object
 1   titleType       86909 non-null  object
 2   primaryTitle    86909 non-null  object
 3   originalTitle   86909 non-null  object
 4   isAdult         86909 non-null  int64
 5   startYear       86909 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86909 non-null  int64
 8   genres          86909 non-null  object
 9   genres_split    86909 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.6+ MB

In [14]:
# Discard unnecessary information
basics = basics.drop(columns= ['genres_split','titleType', 'originalTitle','isAdult',
                     'genres'])

In [15]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86909 entries, 0 to 86908
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86909 non-null  object
 1   primaryTitle    86909 non-null  object
 2   startYear       86909 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  86909 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.3+ MB

## TMDB API Results 

Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).

You only need to keep the imdb_id, revenue, budget, and certification columns

In [16]:
# Check the column names
results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 356 entries, 0 to 355
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                356 non-null    object
 1   adult                  356 non-null    float64
 2   backdrop_path          349 non-null    object
 3   belongs_to_collection  89 non-null     object
 4   budget                 356 non-null    float64
 5   genres                 356 non-null    object
 6   homepage               51 non-null     object
 7   id                     356 non-null    float64
 8   original_language      356 non-null    object
 9   original_title         356 non-null    object
 10  overview               356 non-null    object
 11  popularity             356 non-null    float64
 12  poster_path            356 non-null    object
 13  production_companies   356 non-null    object
 14  production_countries   356 non-null    object
 15  release_date           356 non-null    object
 16  revenue                356 non-null    float64
 17  runtime                356 non-null    float64
 18  spoken_languages       356 non-null    object
 19  status                 356 non-null    object
 20  tagline                328 non-null    object
 21  title                  356 non-null    object
 22  video                  356 non-null    float64
 23  vote_average           356 non-null    float64
 24  vote_count             356 non-null    float64
 25  certification          311 non-null    object
dtypes: float64(9), object(17)
memory usage: 72.4+ KB

In [17]:
# Create a columns to keep variable
keep = ['imdb_id', 'revenue', 'budget', 'certification']

In [18]:
# Discard unnecessary information
results = results[keep]
results

       imdb_id      revenue       budget certification
0    tt0118694   14204632.0     150000.0            PG
1    tt0120467      14904.0     120000.0             R
2    tt0120630  224834564.0   45000000.0             G
3    tt0120753     105983.0    8000000.0             R
4    tt0120755  546388105.0  125000000.0         PG-13
..         ...          ...          ...           ...
351  tt0294289     342855.0        344.0           NaN
352  tt0296042      80631.0    1400010.0           NaN
353  tt0310790     482902.0    3747230.0            PG
354  tt0445841  123021750.0   12500000.0           NaN
355  tt1039952     500000.0     500000.0           NaN

[356 rows x 4 columns]

#  Saving the MySQL tables with tconst as the primary key.

In [19]:
# Login to MySQLWorkbench
username = 'root' 
password = 'root' 

connection = f'mysql+pymysql://{username}:{password}@localhost/movies'
engine = create_engine(connection)

In [20]:
# Create basics table for SQL
## Object columns lengths
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [21]:
# Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

Database created!

In [22]:
# Save to SQL with dtype and index=False
basics.to_sql('title_basics', engine, dtype = basics_schema, if_exists='replace', index=False)

86909

In [23]:
# Create TMDB table for SQL
## Object columns lengths
imdb_len = results['imdb_id'].fillna('').map(len).max()
c_len = results['certification'].fillna('').map(len).max()

# Create a schema dictonary
imdb_schema = {'imdb_id' : String(key_len+1), 
    'revenue' : Float(),
    'budget' :Float(),
    'certification' : Text(c_len+1)}

In [24]:
# Save to SQL with dtype and index=False
results.to_sql('tmdb_data', engine, dtype = imdb_schema, if_exists='replace', index=False)

356

In [25]:
# Create ratings table for SQL
tconst_len = ratings['tconst'].fillna('').map(len).max()
# Create a schema dictonary
ratings_schema = {'tconst' : String(tconst_len+1),
    'averageRating': Float(),
    'numVotes' : Integer()}

In [26]:
# Save to SQL 
ratings.to_sql('title_ratings', engine, dtype = ratings_schema, if_exists='replace', index=False)

503742

In [28]:
# Create title id table for SQL
tconst_len = title_genres['tconst'].fillna('').map(len).max()
# Create a schema dictonary
id_schema = {'tconst' : String(tconst_len+1), 'genre_id' : Integer()}

In [29]:
# Save to SQL 
title_genres.to_sql('title_genres', engine, dtype = id_schema, if_exists='replace', index=False)

162411

In [30]:
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  25 non-null     object
 1   Genre_ID    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [31]:
# Create genres table for SQL
name_len = genre_lookup['Genre_Name'].fillna('').map(len).max()
# Create a schema dictonary
genre_schema = {'Genre_ID': Integer(), 'Genre_Name' : Text(name_len+1)}

In [32]:
# Save to SQL 
genre_lookup.to_sql('genres', engine, dtype = genre_schema, if_exists='replace', index=False)

25

In [33]:
# Make 'tconst' the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

# Final Queries

In [36]:
q= '''SELECT *
FROM title_basics
LIMIT 5''' 

pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [37]:
q= '''SELECT *
FROM title_ratings
LIMIT 5'''

pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265
2  tt0000005            6.2      2631
3  tt0000006            5.1       182
4  tt0000007            5.4       824

In [38]:
q= '''SELECT *
FROM title_genres
LIMIT 5'''

pd.read_sql(q,engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [39]:
q= '''SELECT *
FROM genres
LIMIT 5'''

pd.read_sql(q,engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [40]:
q= '''SELECT *
FROM tmdb_data
LIMIT 5'''

pd.read_sql(q,engine)

     imdb_id      revenue       budget certification
0  tt0118694   14204600.0     150000.0            PG
1  tt0120467      14904.0     120000.0             R
2  tt0120630  224835000.0   45000000.0             G
3  tt0120753     105983.0    8000000.0             R
4  tt0120755  546388000.0  125000000.0         PG-13

In [34]:
# Display database tables
q = '''SHOW TABLES'''

pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data